# Status Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitAPIPostEventArgs..::..Status Property
RevitAPIPostEventArgs Class See Also
---
Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public RevitAPIEventStatus Status { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Status As RevitAPIEventStatus
	Get
```

Visual C++
---
```text
public:
property RevitAPIEventStatus Status {
	RevitAPIEventStatus get ();
}
```

# See Also
RevitAPIPostEventArgs Class
Autodesk.Revit.DB.Events Namespace